Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_tester_tool_hybrid/firmware/src/packs/PIC32CX2051MTG128_DFP/component/uart.h
/* -------- UART_IER : (UART Offset: 0x08) ( /W 32) Interrupt Enable Register -------- */
#define UART_IER_RXRDY_Pos                    _UINT32_(0)                                          /* (UART_IER) Enable RXRDY Interrupt Position */
#define UART_IER_RXRDY_Msk                    (_UINT32_(0x1) << UART_IER_RXRDY_Pos)                /* (UART_IER) Enable RXRDY Interrupt Mask */
#define UART_IER_RXRDY(value)                 (UART_IER_RXRDY_Msk & (_UINT32_(value) << UART_IER_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_IER register */
#define UART_IER_TXRDY_Pos                    _UINT32_(1)                                          /* (UART_IER) Enable TXRDY Interrupt Position */
#define UART_IER_TXRDY_Msk                    (_UINT32_(0x1) << UART_IER_TXRDY_Pos)                /* (UART_IER) Enable TXRDY Interrupt Mask */
#define UART_IER_TXRDY(value)                 (UART_IER_TXRDY_Msk & (_UINT32_(value) << UART_IER_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_IER register */
#define UART_IER_ENDRX_Pos                    _UINT32_(3)                                          /* (UART_IER) Enable End of Receive Transfer Interrupt Position */
#define UART_IER_ENDRX_Msk                    (_UINT32_(0x1) << UART_IER_ENDRX_Pos)                /* (UART_IER) Enable End of Receive Transfer Interrupt Mask */
#define UART_IER_ENDRX(value)                 (UART_IER_ENDRX_Msk & (_UINT32_(value) << UART_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the UART_IER register */
#define UART_IER_ENDTX_Pos                    _UINT32_(4)                                          /* (UART_IER) Enable End of Transmit Interrupt Position */
#define UART_IER_ENDTX_Msk                    (_UINT32_(0x1) << UART_IER_ENDTX_Pos)                /* (UART_IER) Enable End of Transmit Interrupt Mask */
#define UART_IER_ENDTX(value)                 (UART_IER_ENDTX_Msk & (_UINT32_(value) << UART_IER_ENDTX_Pos)) /* Assigment of value for ENDTX in the UART_IER register */
#define UART_IER_OVRE_Pos                     _UINT32_(5)                                          /* (UART_IER) Enable Overrun Error Interrupt Position */
#define UART_IER_OVRE_Msk                     (_UINT32_(0x1) << UART_IER_OVRE_Pos)                 /* (UART_IER) Enable Overrun Error Interrupt Mask */
#define UART_IER_OVRE(value)                  (UART_IER_OVRE_Msk & (_UINT32_(value) << UART_IER_OVRE_Pos)) /* Assigment of value for OVRE in the UART_IER register */
#define UART_IER_FRAME_Pos                    _UINT32_(6)                                          /* (UART_IER) Enable Framing Error Interrupt Position */
#define UART_IER_FRAME_Msk                    (_UINT32_(0x1) << UART_IER_FRAME_Pos)                /* (UART_IER) Enable Framing Error Interrupt Mask */
#define UART_IER_FRAME(value)                 (UART_IER_FRAME_Msk & (_UINT32_(value) << UART_IER_FRAME_Pos)) /* Assigment of value for FRAME in the UART_IER register */
#define UART_IER_PARE_Pos                     _UINT32_(7)                                          /* (UART_IER) Enable Parity Error Interrupt Position */
#define UART_IER_PARE_Msk                     (_UINT32_(0x1) << UART_IER_PARE_Pos)                 /* (UART_IER) Enable Parity Error Interrupt Mask */
#define UART_IER_PARE(value)                  (UART_IER_PARE_Msk & (_UINT32_(value) << UART_IER_PARE_Pos)) /* Assigment of value for PARE in the UART_IER register */
#define UART_IER_TIMEOUT_Pos                  _UINT32_(8)                                          /* (UART_IER) Enable Time-out Interrupt Position */
#define UART_IER_TIMEOUT_Msk                  (_UINT32_(0x1) << UART_IER_TIMEOUT_Pos)              /* (UART_IER) Enable Time-out Interrupt Mask */
#define UART_IER_TIMEOUT(value)               (UART_IER_TIMEOUT_Msk & (_UINT32_(value) << UART_IER_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_IER register */
#define UART_IER_TXEMPTY_Pos                  _UINT32_(9)                                          /* (UART_IER) Enable TXEMPTY Interrupt Position */
#define UART_IER_TXEMPTY_Msk                  (_UINT32_(0x1) << UART_IER_TXEMPTY_Pos)              /* (UART_IER) Enable TXEMPTY Interrupt Mask */
#define UART_IER_TXEMPTY(value)               (UART_IER_TXEMPTY_Msk & (_UINT32_(value) << UART_IER_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_IER register */
#define UART_IER_TXBUFE_Pos                   _UINT32_(11)                                         /* (UART_IER) Enable Buffer Empty Interrupt Position */
#define UART_IER_TXBUFE_Msk                   (_UINT32_(0x1) << UART_IER_TXBUFE_Pos)               /* (UART_IER) Enable Buffer Empty Interrupt Mask */
#define UART_IER_TXBUFE(value)                (UART_IER_TXBUFE_Msk & (_UINT32_(value) << UART_IER_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the UART_IER register */
#define UART_IER_RXBUFF_Pos                   _UINT32_(12)                                         /* (UART_IER) Enable Buffer Full Interrupt Position */
#define UART_IER_RXBUFF_Msk                   (_UINT32_(0x1) << UART_IER_RXBUFF_Pos)               /* (UART_IER) Enable Buffer Full Interrupt Mask */
#define UART_IER_RXBUFF(value)                (UART_IER_RXBUFF_Msk & (_UINT32_(value) << UART_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the UART_IER register */
#define UART_IER_CMP_Pos                      _UINT32_(15)                                         /* (UART_IER) Enable Comparison Interrupt Position */
#define UART_IER_CMP_Msk                      (_UINT32_(0x1) << UART_IER_CMP_Pos)                  /* (UART_IER) Enable Comparison Interrupt Mask */
#define UART_IER_CMP(value)                   (UART_IER_CMP_Msk & (_UINT32_(value) << UART_IER_CMP_Pos)) /* Assigment of value for CMP in the UART_IER register */
#define UART_IER_ACE_Pos                      _UINT32_(16)                                         /* (UART_IER) Enable Analog Comparator Event Interrupt Position */
#define UART_IER_ACE_Msk                      (_UINT32_(0x1) << UART_IER_ACE_Pos)                  /* (UART_IER) Enable Analog Comparator Event Interrupt Mask */
#define UART_IER_ACE(value)                   (UART_IER_ACE_Msk & (_UINT32_(value) << UART_IER_ACE_Pos)) /* Assigment of value for ACE in the UART_IER register */
#define UART_IER_Msk                          _UINT32_(0x00019BFB)                                 /* (UART_IER) Register Mask  */


/* -------- UART_IDR : (UART Offset: 0x0C) ( /W 32) Interrupt Disable Register -------- */
#define UART_IDR_RXRDY_Pos                    _UINT32_(0)                                          /* (UART_IDR) Disable RXRDY Interrupt Position */
#define UART_IDR_RXRDY_Msk                    (_UINT32_(0x1) << UART_IDR_RXRDY_Pos)                /* (UART_IDR) Disable RXRDY Interrupt Mask */
#define UART_IDR_RXRDY(value)                 (UART_IDR_RXRDY_Msk & (_UINT32_(value) << UART_IDR_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_IDR register */
#define UART_IDR_TXRDY_Pos                    _UINT32_(1)                                          /* (UART_IDR) Disable TXRDY Interrupt Position */
#define UART_IDR_TXRDY_Msk                    (_UINT32_(0x1) << UART_IDR_TXRDY_Pos)                /* (UART_IDR) Disable TXRDY Interrupt Mask */
#define UART_IDR_TXRDY(value)                 (UART_IDR_TXRDY_Msk & (_UINT32_(value) << UART_IDR_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_IDR register */
#define UART_IDR_ENDRX_Pos                    _UINT32_(3)                                          /* (UART_IDR) Disable End of Receive Transfer Interrupt Position */
#define UART_IDR_ENDRX_Msk                    (_UINT32_(0x1) << UART_IDR_ENDRX_Pos)                /* (UART_IDR) Disable End of Receive Transfer Interrupt Mask */
#define UART_IDR_ENDRX(value)                 (UART_IDR_ENDRX_Msk & (_UINT32_(value) << UART_IDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the UART_IDR register */
#define UART_IDR_ENDTX_Pos                    _UINT32_(4)                                          /* (UART_IDR) Disable End of Transmit Interrupt Position */
#define UART_IDR_ENDTX_Msk                    (_UINT32_(0x1) << UART_IDR_ENDTX_Pos)                /* (UART_IDR) Disable End of Transmit Interrupt Mask */
#define UART_IDR_ENDTX(value)                 (UART_IDR_ENDTX_Msk & (_UINT32_(value) << UART_IDR_ENDTX_Pos)) /* Assigment of value for ENDTX in the UART_IDR register */
#define UART_IDR_OVRE_Pos                     _UINT32_(5)                                          /* (UART_IDR) Disable Overrun Error Interrupt Position */
#define UART_IDR_OVRE_Msk                     (_UINT32_(0x1) << UART_IDR_OVRE_Pos)                 /* (UART_IDR) Disable Overrun Error Interrupt Mask */
#define UART_IDR_OVRE(value)                  (UART_IDR_OVRE_Msk & (_UINT32_(value) << UART_IDR_OVRE_Pos)) /* Assigment of value for OVRE in the UART_IDR register */
#define UART_IDR_FRAME_Pos                    _UINT32_(6)                                          /* (UART_IDR) Disable Framing Error Interrupt Position */
#define UART_IDR_FRAME_Msk                    (_UINT32_(0x1) << UART_IDR_FRAME_Pos)                /* (UART_IDR) Disable Framing Error Interrupt Mask */
#define UART_IDR_FRAME(value)                 (UART_IDR_FRAME_Msk & (_UINT32_(value) << UART_IDR_FRAME_Pos)) /* Assigment of value for FRAME in the UART_IDR register */
#define UART_IDR_PARE_Pos                     _UINT32_(7)                                          /* (UART_IDR) Disable Parity Error Interrupt Position */
#define UART_IDR_PARE_Msk                     (_UINT32_(0x1) << UART_IDR_PARE_Pos)                 /* (UART_IDR) Disable Parity Error Interrupt Mask */
#define UART_IDR_PARE(value)                  (UART_IDR_PARE_Msk & (_UINT32_(value) << UART_IDR_PARE_Pos)) /* Assigment of value for PARE in the UART_IDR register */
#define UART_IDR_TIMEOUT_Pos                  _UINT32_(8)                                          /* (UART_IDR) Disable Time-out Interrupt Position */
#define UART_IDR_TIMEOUT_Msk                  (_UINT32_(0x1) << UART_IDR_TIMEOUT_Pos)              /* (UART_IDR) Disable Time-out Interrupt Mask */
#define UART_IDR_TIMEOUT(value)               (UART_IDR_TIMEOUT_Msk & (_UINT32_(value) << UART_IDR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_IDR register */
#define UART_IDR_TXEMPTY_Pos                  _UINT32_(9)                                          /* (UART_IDR) Disable TXEMPTY Interrupt Position */
#define UART_IDR_TXEMPTY_Msk                  (_UINT32_(0x1) << UART_IDR_TXEMPTY_Pos)              /* (UART_IDR) Disable TXEMPTY Interrupt Mask */
#define UART_IDR_TXEMPTY(value)               (UART_IDR_TXEMPTY_Msk & (_UINT32_(value) << UART_IDR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_IDR register */
#define UART_IDR_TXBUFE_Pos                   _UINT32_(11)                                         /* (UART_IDR) Disable Buffer Empty Interrupt Position */
#define UART_IDR_TXBUFE_Msk                   (_UINT32_(0x1) << UART_IDR_TXBUFE_Pos)               /* (UART_IDR) Disable Buffer Empty Interrupt Mask */
#define UART_IDR_TXBUFE(value)                (UART_IDR_TXBUFE_Msk & (_UINT32_(value) << UART_IDR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the UART_IDR register */
#define UART_IDR_RXBUFF_Pos                   _UINT32_(12)                                         /* (UART_IDR) Disable Buffer Full Interrupt Position */
#define UART_IDR_RXBUFF_Msk                   (_UINT32_(0x1) << UART_IDR_RXBUFF_Pos)               /* (UART_IDR) Disable Buffer Full Interrupt Mask */
#define UART_IDR_RXBUFF(value)                (UART_IDR_RXBUFF_Msk & (_UINT32_(value) << UART_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the UART_IDR register */
#define UART_IDR_CMP_Pos                      _UINT32_(15)                                         /* (UART_IDR) Disable Comparison Interrupt Position */
#define UART_IDR_CMP_Msk                      (_UINT32_(0x1) << UART_IDR_CMP_Pos)                  /* (UART_IDR) Disable Comparison Interrupt Mask */
#define UART_IDR_CMP(value)                   (UART_IDR_CMP_Msk & (_UINT32_(value) << UART_IDR_CMP_Pos)) /* Assigment of value for CMP in the UART_IDR register */
#define UART_IDR_ACE_Pos                      _UINT32_(16)                                         /* (UART_IDR) Disable Analog Comparator Event Interrupt Position */
#define UART_IDR_ACE_Msk                      (_UINT32_(0x1) << UART_IDR_ACE_Pos)                  /* (UART_IDR) Disable Analog Comparator Event Interrupt Mask */
#define UART_IDR_ACE(value)                   (UART_IDR_ACE_Msk & (_UINT32_(value) << UART_IDR_ACE_Pos)) /* Assigment of value for ACE in the UART_IDR register */
#define UART_IDR_Msk                          _UINT32_(0x00019BFB)                                 /* (UART_IDR) Register Mask  */


/* -------- UART_IMR : (UART Offset: 0x10) ( R/ 32) Interrupt Mask Register -------- */
#define UART_IMR_RXRDY_Pos                    _UINT32_(0)                                          /* (UART_IMR) Mask RXRDY Interrupt Position */
#define UART_IMR_RXRDY_Msk                    (_UINT32_(0x1) << UART_IMR_RXRDY_Pos)                /* (UART_IMR) Mask RXRDY Interrupt Mask */
#define UART_IMR_RXRDY(value)                 (UART_IMR_RXRDY_Msk & (_UINT32_(value) << UART_IMR_RXRDY_Pos)) /* Assigment of value for RXRDY in the UART_IMR register */
#define UART_IMR_TXRDY_Pos                    _UINT32_(1)                                          /* (UART_IMR) Mask TXRDY Interrupt Position */
#define UART_IMR_TXRDY_Msk                    (_UINT32_(0x1) << UART_IMR_TXRDY_Pos)                /* (UART_IMR) Mask TXRDY Interrupt Mask */
#define UART_IMR_TXRDY(value)                 (UART_IMR_TXRDY_Msk & (_UINT32_(value) << UART_IMR_TXRDY_Pos)) /* Assigment of value for TXRDY in the UART_IMR register */
#define UART_IMR_ENDRX_Pos                    _UINT32_(3)                                          /* (UART_IMR) Mask End of Receive Transfer Interrupt Position */
#define UART_IMR_ENDRX_Msk                    (_UINT32_(0x1) << UART_IMR_ENDRX_Pos)                /* (UART_IMR) Mask End of Receive Transfer Interrupt Mask */
#define UART_IMR_ENDRX(value)                 (UART_IMR_ENDRX_Msk & (_UINT32_(value) << UART_IMR_ENDRX_Pos)) /* Assigment of value for ENDRX in the UART_IMR register */
#define UART_IMR_ENDTX_Pos                    _UINT32_(4)                                          /* (UART_IMR) Mask End of Transmit Interrupt Position */
#define UART_IMR_ENDTX_Msk                    (_UINT32_(0x1) << UART_IMR_ENDTX_Pos)                /* (UART_IMR) Mask End of Transmit Interrupt Mask */
#define UART_IMR_ENDTX(value)                 (UART_IMR_ENDTX_Msk & (_UINT32_(value) << UART_IMR_ENDTX_Pos)) /* Assigment of value for ENDTX in the UART_IMR register */
#define UART_IMR_OVRE_Pos                     _UINT32_(5)                                          /* (UART_IMR) Mask Overrun Error Interrupt Position */
#define UART_IMR_OVRE_Msk                     (_UINT32_(0x1) << UART_IMR_OVRE_Pos)                 /* (UART_IMR) Mask Overrun Error Interrupt Mask */
#define UART_IMR_OVRE(value)                  (UART_IMR_OVRE_Msk & (_UINT32_(value) << UART_IMR_OVRE_Pos)) /* Assigment of value for OVRE in the UART_IMR register */
#define UART_IMR_FRAME_Pos                    _UINT32_(6)                                          /* (UART_IMR) Mask Framing Error Interrupt Position */
#define UART_IMR_FRAME_Msk                    (_UINT32_(0x1) << UART_IMR_FRAME_Pos)                /* (UART_IMR) Mask Framing Error Interrupt Mask */
#define UART_IMR_FRAME(value)                 (UART_IMR_FRAME_Msk & (_UINT32_(value) << UART_IMR_FRAME_Pos)) /* Assigment of value for FRAME in the UART_IMR register */
#define UART_IMR_PARE_Pos                     _UINT32_(7)                                          /* (UART_IMR) Mask Parity Error Interrupt Position */
#define UART_IMR_PARE_Msk                     (_UINT32_(0x1) << UART_IMR_PARE_Pos)                 /* (UART_IMR) Mask Parity Error Interrupt Mask */
#define UART_IMR_PARE(value)                  (UART_IMR_PARE_Msk & (_UINT32_(value) << UART_IMR_PARE_Pos)) /* Assigment of value for PARE in the UART_IMR register */
#define UART_IMR_TIMEOUT_Pos                  _UINT32_(8)                                          /* (UART_IMR) Mask Time-out Interrupt Position */
#define UART_IMR_TIMEOUT_Msk                  (_UINT32_(0x1) << UART_IMR_TIMEOUT_Pos)              /* (UART_IMR) Mask Time-out Interrupt Mask */
#define UART_IMR_TIMEOUT(value)               (UART_IMR_TIMEOUT_Msk & (_UINT32_(value) << UART_IMR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the UART_IMR register */
#define UART_IMR_TXEMPTY_Pos                  _UINT32_(9)                                          /* (UART_IMR) Mask TXEMPTY Interrupt Position */
#define UART_IMR_TXEMPTY_Msk                  (_UINT32_(0x1) << UART_IMR_TXEMPTY_Pos)              /* (UART_IMR) Mask TXEMPTY Interrupt Mask */
#define UART_IMR_TXEMPTY(value)               (UART_IMR_TXEMPTY_Msk & (_UINT32_(value) << UART_IMR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the UART_IMR register */
#define UART_IMR_TXBUFE_Pos                   _UINT32_(11)                                         /* (UART_IMR) Mask TXBUFE Interrupt Position */
#define UART_IMR_TXBUFE_Msk                   (_UINT32_(0x1) << UART_IMR_TXBUFE_Pos)               /* (UART_IMR) Mask TXBUFE Interrupt Mask */
#define UART_IMR_TXBUFE(value)                (UART_IMR_TXBUFE_Msk & (_UINT32_(value) << UART_IMR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the UART_IMR register */
#define UART_IMR_RXBUFF_Pos                   _UINT32_(12)                                         /* (UART_IMR) Mask RXBUFF Interrupt Position */
#define UART_IMR_RXBUFF_Msk                   (_UINT32_(0x1) << UART_IMR_RXBUFF_Pos)               /* (UART_IMR) Mask RXBUFF Interrupt Mask */
#define UART_IMR_RXBUFF(value)                (UART_IMR_RXBUFF_Msk & (_UINT32_(value) << UART_IMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the UART_IMR register */
#define UART_IMR_CMP_Pos                      _UINT32_(15)                                         /* (UART_IMR) Mask Comparison Interrupt Position */
#define UART_IMR_CMP_Msk                      (_UINT32_(0x1) << UART_IMR_CMP_Pos)                  /* (UART_IMR) Mask Comparison Interrupt Mask */
#define UART_IMR_CMP(value)                   (UART_IMR_CMP_Msk & (_UINT32_(value) << UART_IMR_CMP_Pos)) /* Assigment of value for CMP in the UART_IMR register */
#define UART_IMR_ACE_Pos                      _UINT32_(16)                                         /* (UART_IMR) Mask Analog Comparator Event Interrupt Position */
#define UART_IMR_ACE_Msk                      (_UINT32_(0x1) << UART_IMR_ACE_Pos)                  /* (UART_IMR) Mask Analog Comparator Event Interrupt Mask */
#define UART_IMR_ACE(value)                   (UART_IMR_ACE_Msk & (_UINT32_(value) << UART_IMR_ACE_Pos)) /* Assigment of value for ACE in the UART_IMR register */
#define UART_IMR_Msk                          _UINT32_(0x00019BFB)                                 /* (UART_IMR) Register Mask  */


