Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_tester_tool_hybrid/firmware/src/packs/PIC32CX2051MTG128_DFP/component/uart.h
/* -------- UART_WPMR : (UART Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define UART_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (UART_WPMR) Write Protection Enable Position */
#define UART_WPMR_WPEN_Msk                    (_UINT32_(0x1) << UART_WPMR_WPEN_Pos)                /* (UART_WPMR) Write Protection Enable Mask */
#define UART_WPMR_WPEN(value)                 (UART_WPMR_WPEN_Msk & (_UINT32_(value) << UART_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the UART_WPMR register */
#define UART_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (UART_WPMR) Write Protection Key Position */
#define UART_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << UART_WPMR_WPKEY_Pos)          /* (UART_WPMR) Write Protection Key Mask */
#define UART_WPMR_WPKEY(value)                (UART_WPMR_WPKEY_Msk & (_UINT32_(value) << UART_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the UART_WPMR register */
#define   UART_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x554152)                                   /* (UART_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define UART_WPMR_WPKEY_PASSWD                (UART_WPMR_WPKEY_PASSWD_Val << UART_WPMR_WPKEY_Pos)  /* (UART_WPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define UART_WPMR_Msk                         _UINT32_(0xFFFFFF01)                                 /* (UART_WPMR) Register Mask  */


/* -------- UART_RPR : (UART Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define UART_RPR_RXPTR_Pos                    _UINT32_(0)                                          /* (UART_RPR) Receive Pointer Register Position */
#define UART_RPR_RXPTR_Msk                    (_UINT32_(0xFFFFFFFF) << UART_RPR_RXPTR_Pos)         /* (UART_RPR) Receive Pointer Register Mask */
#define UART_RPR_RXPTR(value)                 (UART_RPR_RXPTR_Msk & (_UINT32_(value) << UART_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the UART_RPR register */
#define UART_RPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (UART_RPR) Register Mask  */


/* -------- UART_RCR : (UART Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define UART_RCR_RXCTR_Pos                    _UINT32_(0)                                          /* (UART_RCR) Receive Counter Register Position */
#define UART_RCR_RXCTR_Msk                    (_UINT32_(0xFFFF) << UART_RCR_RXCTR_Pos)             /* (UART_RCR) Receive Counter Register Mask */
#define UART_RCR_RXCTR(value)                 (UART_RCR_RXCTR_Msk & (_UINT32_(value) << UART_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the UART_RCR register */
#define UART_RCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (UART_RCR) Register Mask  */


/* -------- UART_TPR : (UART Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define UART_TPR_TXPTR_Pos                    _UINT32_(0)                                          /* (UART_TPR) Transmit Counter Register Position */
#define UART_TPR_TXPTR_Msk                    (_UINT32_(0xFFFFFFFF) << UART_TPR_TXPTR_Pos)         /* (UART_TPR) Transmit Counter Register Mask */
#define UART_TPR_TXPTR(value)                 (UART_TPR_TXPTR_Msk & (_UINT32_(value) << UART_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the UART_TPR register */
#define UART_TPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (UART_TPR) Register Mask  */


/* -------- UART_TCR : (UART Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define UART_TCR_TXCTR_Pos                    _UINT32_(0)                                          /* (UART_TCR) Transmit Counter Register Position */
#define UART_TCR_TXCTR_Msk                    (_UINT32_(0xFFFF) << UART_TCR_TXCTR_Pos)             /* (UART_TCR) Transmit Counter Register Mask */
#define UART_TCR_TXCTR(value)                 (UART_TCR_TXCTR_Msk & (_UINT32_(value) << UART_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the UART_TCR register */
#define UART_TCR_Msk                          _UINT32_(0x0000FFFF)                                 /* (UART_TCR) Register Mask  */


/* -------- UART_RNPR : (UART Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define UART_RNPR_RXNPTR_Pos                  _UINT32_(0)                                          /* (UART_RNPR) Receive Next Pointer Position */
#define UART_RNPR_RXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << UART_RNPR_RXNPTR_Pos)       /* (UART_RNPR) Receive Next Pointer Mask */
#define UART_RNPR_RXNPTR(value)               (UART_RNPR_RXNPTR_Msk & (_UINT32_(value) << UART_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the UART_RNPR register */
#define UART_RNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (UART_RNPR) Register Mask  */


/* -------- UART_RNCR : (UART Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define UART_RNCR_RXNCTR_Pos                  _UINT32_(0)                                          /* (UART_RNCR) Receive Next Counter Position */
#define UART_RNCR_RXNCTR_Msk                  (_UINT32_(0xFFFF) << UART_RNCR_RXNCTR_Pos)           /* (UART_RNCR) Receive Next Counter Mask */
#define UART_RNCR_RXNCTR(value)               (UART_RNCR_RXNCTR_Msk & (_UINT32_(value) << UART_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the UART_RNCR register */
#define UART_RNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (UART_RNCR) Register Mask  */


/* -------- UART_TNPR : (UART Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define UART_TNPR_TXNPTR_Pos                  _UINT32_(0)                                          /* (UART_TNPR) Transmit Next Pointer Position */
#define UART_TNPR_TXNPTR_Msk                  (_UINT32_(0xFFFFFFFF) << UART_TNPR_TXNPTR_Pos)       /* (UART_TNPR) Transmit Next Pointer Mask */
#define UART_TNPR_TXNPTR(value)               (UART_TNPR_TXNPTR_Msk & (_UINT32_(value) << UART_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the UART_TNPR register */
#define UART_TNPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (UART_TNPR) Register Mask  */


/* -------- UART_TNCR : (UART Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define UART_TNCR_TXNCTR_Pos                  _UINT32_(0)                                          /* (UART_TNCR) Transmit Counter Next Position */
#define UART_TNCR_TXNCTR_Msk                  (_UINT32_(0xFFFF) << UART_TNCR_TXNCTR_Pos)           /* (UART_TNCR) Transmit Counter Next Mask */
#define UART_TNCR_TXNCTR(value)               (UART_TNCR_TXNCTR_Msk & (_UINT32_(value) << UART_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the UART_TNCR register */
#define UART_TNCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (UART_TNCR) Register Mask  */


/* -------- UART_PTCR : (UART Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define UART_PTCR_RXTEN_Pos                   _UINT32_(0)                                          /* (UART_PTCR) Receiver Transfer Enable Position */
#define UART_PTCR_RXTEN_Msk                   (_UINT32_(0x1) << UART_PTCR_RXTEN_Pos)               /* (UART_PTCR) Receiver Transfer Enable Mask */
#define UART_PTCR_RXTEN(value)                (UART_PTCR_RXTEN_Msk & (_UINT32_(value) << UART_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the UART_PTCR register */
#define UART_PTCR_RXTDIS_Pos                  _UINT32_(1)                                          /* (UART_PTCR) Receiver Transfer Disable Position */
#define UART_PTCR_RXTDIS_Msk                  (_UINT32_(0x1) << UART_PTCR_RXTDIS_Pos)              /* (UART_PTCR) Receiver Transfer Disable Mask */
#define UART_PTCR_RXTDIS(value)               (UART_PTCR_RXTDIS_Msk & (_UINT32_(value) << UART_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the UART_PTCR register */
#define UART_PTCR_TXTEN_Pos                   _UINT32_(8)                                          /* (UART_PTCR) Transmitter Transfer Enable Position */
#define UART_PTCR_TXTEN_Msk                   (_UINT32_(0x1) << UART_PTCR_TXTEN_Pos)               /* (UART_PTCR) Transmitter Transfer Enable Mask */
#define UART_PTCR_TXTEN(value)                (UART_PTCR_TXTEN_Msk & (_UINT32_(value) << UART_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the UART_PTCR register */
#define UART_PTCR_TXTDIS_Pos                  _UINT32_(9)                                          /* (UART_PTCR) Transmitter Transfer Disable Position */
#define UART_PTCR_TXTDIS_Msk                  (_UINT32_(0x1) << UART_PTCR_TXTDIS_Pos)              /* (UART_PTCR) Transmitter Transfer Disable Mask */
#define UART_PTCR_TXTDIS(value)               (UART_PTCR_TXTDIS_Msk & (_UINT32_(value) << UART_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the UART_PTCR register */
#define UART_PTCR_RXCBEN_Pos                  _UINT32_(16)                                         /* (UART_PTCR) Receiver Circular Buffer Enable Position */
#define UART_PTCR_RXCBEN_Msk                  (_UINT32_(0x1) << UART_PTCR_RXCBEN_Pos)              /* (UART_PTCR) Receiver Circular Buffer Enable Mask */
#define UART_PTCR_RXCBEN(value)               (UART_PTCR_RXCBEN_Msk & (_UINT32_(value) << UART_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the UART_PTCR register */
#define UART_PTCR_RXCBDIS_Pos                 _UINT32_(17)                                         /* (UART_PTCR) Receiver Circular Buffer Disable Position */
#define UART_PTCR_RXCBDIS_Msk                 (_UINT32_(0x1) << UART_PTCR_RXCBDIS_Pos)             /* (UART_PTCR) Receiver Circular Buffer Disable Mask */
#define UART_PTCR_RXCBDIS(value)              (UART_PTCR_RXCBDIS_Msk & (_UINT32_(value) << UART_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the UART_PTCR register */
#define UART_PTCR_TXCBEN_Pos                  _UINT32_(18)                                         /* (UART_PTCR) Transmitter Circular Buffer Enable Position */
#define UART_PTCR_TXCBEN_Msk                  (_UINT32_(0x1) << UART_PTCR_TXCBEN_Pos)              /* (UART_PTCR) Transmitter Circular Buffer Enable Mask */
#define UART_PTCR_TXCBEN(value)               (UART_PTCR_TXCBEN_Msk & (_UINT32_(value) << UART_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the UART_PTCR register */
#define UART_PTCR_TXCBDIS_Pos                 _UINT32_(19)                                         /* (UART_PTCR) Transmitter Circular Buffer Disable Position */
#define UART_PTCR_TXCBDIS_Msk                 (_UINT32_(0x1) << UART_PTCR_TXCBDIS_Pos)             /* (UART_PTCR) Transmitter Circular Buffer Disable Mask */
#define UART_PTCR_TXCBDIS(value)              (UART_PTCR_TXCBDIS_Msk & (_UINT32_(value) << UART_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the UART_PTCR register */
#define UART_PTCR_ERRCLR_Pos                  _UINT32_(24)                                         /* (UART_PTCR) Transfer Bus Error Clear Position */
#define UART_PTCR_ERRCLR_Msk                  (_UINT32_(0x1) << UART_PTCR_ERRCLR_Pos)              /* (UART_PTCR) Transfer Bus Error Clear Mask */
#define UART_PTCR_ERRCLR(value)               (UART_PTCR_ERRCLR_Msk & (_UINT32_(value) << UART_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the UART_PTCR register */
#define UART_PTCR_Msk                         _UINT32_(0x010F0303)                                 /* (UART_PTCR) Register Mask  */


/* -------- UART_PTSR : (UART Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define UART_PTSR_RXTEN_Pos                   _UINT32_(0)                                          /* (UART_PTSR) Receiver Transfer Enable Position */
#define UART_PTSR_RXTEN_Msk                   (_UINT32_(0x1) << UART_PTSR_RXTEN_Pos)               /* (UART_PTSR) Receiver Transfer Enable Mask */
#define UART_PTSR_RXTEN(value)                (UART_PTSR_RXTEN_Msk & (_UINT32_(value) << UART_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the UART_PTSR register */
#define UART_PTSR_TXTEN_Pos                   _UINT32_(8)                                          /* (UART_PTSR) Transmitter Transfer Enable Position */
#define UART_PTSR_TXTEN_Msk                   (_UINT32_(0x1) << UART_PTSR_TXTEN_Pos)               /* (UART_PTSR) Transmitter Transfer Enable Mask */
#define UART_PTSR_TXTEN(value)                (UART_PTSR_TXTEN_Msk & (_UINT32_(value) << UART_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the UART_PTSR register */
#define UART_PTSR_RXCBEN_Pos                  _UINT32_(16)                                         /* (UART_PTSR) Receiver Circular Buffer Enable Position */
#define UART_PTSR_RXCBEN_Msk                  (_UINT32_(0x1) << UART_PTSR_RXCBEN_Pos)              /* (UART_PTSR) Receiver Circular Buffer Enable Mask */
#define UART_PTSR_RXCBEN(value)               (UART_PTSR_RXCBEN_Msk & (_UINT32_(value) << UART_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the UART_PTSR register */
#define UART_PTSR_TXCBEN_Pos                  _UINT32_(18)                                         /* (UART_PTSR) Transmitter Circular Buffer Enable Position */
#define UART_PTSR_TXCBEN_Msk                  (_UINT32_(0x1) << UART_PTSR_TXCBEN_Pos)              /* (UART_PTSR) Transmitter Circular Buffer Enable Mask */
#define UART_PTSR_TXCBEN(value)               (UART_PTSR_TXCBEN_Msk & (_UINT32_(value) << UART_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the UART_PTSR register */
#define UART_PTSR_ERR_Pos                     _UINT32_(24)                                         /* (UART_PTSR) Transfer Bus Error Position */
#define UART_PTSR_ERR_Msk                     (_UINT32_(0x1) << UART_PTSR_ERR_Pos)                 /* (UART_PTSR) Transfer Bus Error Mask */
#define UART_PTSR_ERR(value)                  (UART_PTSR_ERR_Msk & (_UINT32_(value) << UART_PTSR_ERR_Pos)) /* Assigment of value for ERR in the UART_PTSR register */
#define UART_PTSR_Msk                         _UINT32_(0x01050101)                                 /* (UART_PTSR) Register Mask  */


/* -------- UART_PWPMR : (UART Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define UART_PWPMR_WPPTREN_Pos                _UINT32_(0)                                          /* (UART_PWPMR) Write Protection Pointer Registers Enable Position */
#define UART_PWPMR_WPPTREN_Msk                (_UINT32_(0x1) << UART_PWPMR_WPPTREN_Pos)            /* (UART_PWPMR) Write Protection Pointer Registers Enable Mask */
#define UART_PWPMR_WPPTREN(value)             (UART_PWPMR_WPPTREN_Msk & (_UINT32_(value) << UART_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the UART_PWPMR register */
#define UART_PWPMR_WPCTREN_Pos                _UINT32_(1)                                          /* (UART_PWPMR) Write Protection Counter Registers Enable Position */
#define UART_PWPMR_WPCTREN_Msk                (_UINT32_(0x1) << UART_PWPMR_WPCTREN_Pos)            /* (UART_PWPMR) Write Protection Counter Registers Enable Mask */
#define UART_PWPMR_WPCTREN(value)             (UART_PWPMR_WPCTREN_Msk & (_UINT32_(value) << UART_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the UART_PWPMR register */
#define UART_PWPMR_WPCREN_Pos                 _UINT32_(2)                                          /* (UART_PWPMR) Write Protection Control Register Enable Position */
#define UART_PWPMR_WPCREN_Msk                 (_UINT32_(0x1) << UART_PWPMR_WPCREN_Pos)             /* (UART_PWPMR) Write Protection Control Register Enable Mask */
#define UART_PWPMR_WPCREN(value)              (UART_PWPMR_WPCREN_Msk & (_UINT32_(value) << UART_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the UART_PWPMR register */
#define UART_PWPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (UART_PWPMR) Write Protection Key Position */
#define UART_PWPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << UART_PWPMR_WPKEY_Pos)         /* (UART_PWPMR) Write Protection Key Mask */
#define UART_PWPMR_WPKEY(value)               (UART_PWPMR_WPKEY_Msk & (_UINT32_(value) << UART_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the UART_PWPMR register */
#define   UART_PWPMR_WPKEY_PASSWD_Val         _UINT32_(0x504443)                                   /* (UART_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define UART_PWPMR_WPKEY_PASSWD               (UART_PWPMR_WPKEY_PASSWD_Val << UART_PWPMR_WPKEY_Pos) /* (UART_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define UART_PWPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (UART_PWPMR) Register Mask  */


