Microchip-MPLAB-Harmony/smartenergy_prime_apps/apps/phy_apps/phy_tester_tool_hybrid/firmware/src/packs/PIC32CX2051MTG128_DFP/component/uart.h
/** \brief UART register offsets definitions */
#define UART_CR_REG_OFST               _UINT32_(0x00)      /* (UART_CR) Control Register Offset */
#define UART_MR_REG_OFST               _UINT32_(0x04)      /* (UART_MR) Mode Register Offset */
#define UART_IER_REG_OFST              _UINT32_(0x08)      /* (UART_IER) Interrupt Enable Register Offset */
#define UART_IDR_REG_OFST              _UINT32_(0x0C)      /* (UART_IDR) Interrupt Disable Register Offset */
#define UART_IMR_REG_OFST              _UINT32_(0x10)      /* (UART_IMR) Interrupt Mask Register Offset */
#define UART_SR_REG_OFST               _UINT32_(0x14)      /* (UART_SR) Interrupt Status Register Offset */
#define UART_RHR_REG_OFST              _UINT32_(0x18)      /* (UART_RHR) Receive Holding Register Offset */
#define UART_THR_REG_OFST              _UINT32_(0x1C)      /* (UART_THR) Transmit Holding Register Offset */
#define UART_BRGR_REG_OFST             _UINT32_(0x20)      /* (UART_BRGR) Baud Rate Generator Register Offset */
#define UART_CMPR_REG_OFST             _UINT32_(0x24)      /* (UART_CMPR) Comparison Register Offset */
#define UART_RTOR_REG_OFST             _UINT32_(0x28)      /* (UART_RTOR) Receiver Time-out Register Offset */
#define UART_CSR_REG_OFST              _UINT32_(0x2C)      /* (UART_CSR) Current Status Register Offset */
#define UART_WPMR_REG_OFST             _UINT32_(0xE4)      /* (UART_WPMR) Write Protection Mode Register Offset */
#define UART_RPR_REG_OFST              _UINT32_(0x100)     /* (UART_RPR) Receive Pointer Register Offset */
#define UART_RCR_REG_OFST              _UINT32_(0x104)     /* (UART_RCR) Receive Counter Register Offset */
#define UART_TPR_REG_OFST              _UINT32_(0x108)     /* (UART_TPR) Transmit Pointer Register Offset */
#define UART_TCR_REG_OFST              _UINT32_(0x10C)     /* (UART_TCR) Transmit Counter Register Offset */
#define UART_RNPR_REG_OFST             _UINT32_(0x110)     /* (UART_RNPR) Receive Next Pointer Register Offset */
#define UART_RNCR_REG_OFST             _UINT32_(0x114)     /* (UART_RNCR) Receive Next Counter Register Offset */
#define UART_TNPR_REG_OFST             _UINT32_(0x118)     /* (UART_TNPR) Transmit Next Pointer Register Offset */
#define UART_TNCR_REG_OFST             _UINT32_(0x11C)     /* (UART_TNCR) Transmit Next Counter Register Offset */
#define UART_PTCR_REG_OFST             _UINT32_(0x120)     /* (UART_PTCR) Transfer Control Register Offset */
#define UART_PTSR_REG_OFST             _UINT32_(0x124)     /* (UART_PTSR) Transfer Status Register Offset */
#define UART_PWPMR_REG_OFST            _UINT32_(0x128)     /* (UART_PWPMR) Write Protection Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UART register API structure */
typedef struct
{
  __O   uint32_t                       UART_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       UART_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __O   uint32_t                       UART_IER;           /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       UART_IDR;           /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       UART_IMR;           /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       UART_SR;            /**< Offset: 0x14 (R/   32) Interrupt Status Register */
  __I   uint32_t                       UART_RHR;           /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O   uint32_t                       UART_THR;           /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO  uint32_t                       UART_BRGR;          /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO  uint32_t                       UART_CMPR;          /**< Offset: 0x24 (R/W  32) Comparison Register */
  __IO  uint32_t                       UART_RTOR;          /**< Offset: 0x28 (R/W  32) Receiver Time-out Register */
  __I   uint32_t                       UART_CSR;           /**< Offset: 0x2C (R/   32) Current Status Register */
  __I   uint8_t                        Reserved1[0xB4];
  __IO  uint32_t                       UART_WPMR;          /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint8_t                        Reserved2[0x18];
  __IO  uint32_t                       UART_RPR;           /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       UART_RCR;           /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO  uint32_t                       UART_TPR;           /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO  uint32_t                       UART_TCR;           /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO  uint32_t                       UART_RNPR;          /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       UART_RNCR;          /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO  uint32_t                       UART_TNPR;          /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO  uint32_t                       UART_TNCR;          /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O   uint32_t                       UART_PTCR;          /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       UART_PTSR;          /**< Offset: 0x124 (R/   32) Transfer Status Register */
  __IO  uint32_t                       UART_PWPMR;         /**< Offset: 0x128 (R/W  32) Write Protection Mode Register */
} uart_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTG_UART_COMPONENT_H_ */
